// console.log("check script");
// number
// string
// boolean

// console.log - функция, которая позволяет выводить информацию в консоль браузера

// устаревшее
// var a; - декларация переменной
// a = 'hello' - инициализация переменной
// var a = 'hello' - тоже самое, но в одну строку

// блок инициализации - это комната, в которой код может выполняться
// {
//     let a = 'hello a';
//     var b = 'hello b';
// }
// console.log(b); // переменная оказывается доступной даже за пределами комнаты
// console.log(a);

// константы принято называть заглавными буквами
const PI = 3.14;
console.log(PI);
// PI = 123;
// значение PI не меняется


let a = 'check';
console.log(a);
a = 'new'
console.log(a);
// значение а поменялось
